//
//  ArrayTextForFAQ.m
//  Sadovod
//
//  Created by Виктор Мишустин on 09/09/16.
//  Copyright © 2016 Виктор Мишустин. All rights reserved.
//

#import "ArrayTextForFAQ.h"

@implementation ArrayTextForFAQ


+ (NSArray*) createArrayText {
    
    NSArray * arrayText = [NSArray arrayWithObjects:
                           @"Претензии принимаются в течени 6 дней с момента получения заказа через почту info@tk-sad.ru. Обработка претензий может составить 3-5 рабочих дней, не считая дня подачи претензии. Присылайте полное описание проблемы вместе с фото, если имеется. При недовложении указывайте так же номер заказ, артикул, и стоимость не вложенных вещей. По недовложению фото можно взять с сайта либо указать ссылки на товар. При несоответствии размера, фото делайте с сантиметровой лентой.",
                           
                           @"При совершении заказа мы высылаем Вам на почту информацию с подтверждением о принятии заказа, затем мы обрабатывам его от 15 минут до нескольких часов, затем Вам на почту выставляется счет со всем содержанием заказа и реквизитами для оплаты. После получении оплаты заказ собирается от 1 до 7 рабочих дней, затем мы его отправляем на почту или в ТК.",
                           
                           @"Из расчета, что товара на 1000 руб. -это примерно 1 кг (если в заказе есть постельное белье - примерно + 2 кг за комплект).\nТовара до 10 000 руб. - это 1 место – объем - 0,1 куб.м.\nУпаковка у нас мешки. На сайтах компаний можно посмотреть есть ли их филиалы (терминалы) в вашем городе.\nТранспортные компании с которыми мы работаем:",
                           
                           @"Отгрузка товара осуществляется ближайшей отправкой в день сборки заказа, либо на следующий день.",
                           
                           @"Оплатить заказ Вы сможете сразу же после выставления счета оператором.\nМы принимаем 6 способов оплаты:\n  Переводом с карты на карту через Сбербанк\n  Яндекс деньги\n  WebMoney\n  Qiwi кошелек\n  Квитанция Сбербанка\n  безналичным расчетом (при оптовом заказе)",
                           
                           @"Доставка производится по всем регионам РФ и СНГ.\nСпособ доставки вы должны выбрать самостоятельно из предложенного ниже.\n  Платная доставка курьером по Москве - 450 руб.\n  Бесплатная доставка до Почты России\n  Бесплатная доставка до выбранной транспортной компании\nОплата доставки осуществляется Вами при получении заказа.\nДоставка товара ДО вышеуказанных транспортных компаний г.Москва осуществляется бесплатно.\nСопроводительные документы для ТК оформляются нами при подготовке Вашего заказа к отправке.",
                           
                           @"Мы работаем с 10 до 18 часов ежедневно кроме субботы. Сборка и отправка товара каждый день.\nОплата по квитанции или банковскому переводу в выходные не зачисляется, все остальные способы оплаты зачисляются.",
                           
                           @"Оплата на расчетный счет проходит в течении 2-3 рабочих банковских дней. Оплата этим способом в выходные дни не зачисляется. Все остальные способы оплат зачисляются обычно от 15 минут до нескольких часов.", nil];
    
    
    
    
    
    return arrayText;
}

@end
